# Напишите программу, определяющую время падения камня на поверхность земли с высоты 
h = float(input("Введите h: "))
g = 9.8
print("t =", (2*h / g)**0.5)
