# Дана длина ребра куба. Напишите программу, которая вычисляет объём куба и площадь его боковой поверхности.
r = float(input("Ведите длину ребра куба: "))
print("Объем куба:", r**3)
print("Площадь боковой поверхности куба:", r**2 * 6)
